In [53]:
import pandas as pd
df=pd.read_csv("C:/Users/ritti/Downloads/internal_skill_stuff/PYTHON_PANDAS_PRACTICE/nyc_weather.csv")

In [54]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [55]:
#what is the maximum temperature?
df["Temperature"].max()

50

In [56]:
# which day it was raining?

df["EST"][df["Events"]=="Rain"]

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [57]:
# what is the average wind speed?
df["WindSpeedMPH"].mean()

6.892857142857143

In [58]:
# Data munging and data wrangling
# nothing but processing and cleaning the data

df["WindSpeedMPH"].fillna(0,inplace=True)

C:\Users\ritti\AppData\Local\Temp/ipykernel_7428/1922518287.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["WindSpeedMPH"].fillna(0,inplace=True)

In [59]:
df["WindSpeedMPH"].mean()

6.225806451612903

In [60]:
nyc_weather={'temp':[1,2,3,4],
            'date':['12/12/2023','10/9/2001','3/3/2021','14/8/2001'],
            'name':["raja","lolit","mili","priya"],
            'event':["rain","sun","cloud","rain"],
            'windspeed':[2,3,4,5]}
df1=pd.DataFrame(nyc_weather)

In [61]:
df1

   temp        date   name  event  windspeed
0     1  12/12/2023   raja   rain          2
1     2   10/9/2001  lolit    sun          3
2     3    3/3/2021   mili  cloud          4
3     4   14/8/2001  priya   rain          5

In [62]:
#wrong
df.shape()

TypeError: 'tuple' object is not callable

In [63]:
#right
df.shape

(31, 11)

In [64]:
col,row=df.shape
print(col)
print(row)

31
11

In [65]:
df1[2:]

   temp       date   name  event  windspeed
2     3   3/3/2021   mili  cloud          4
3     4  14/8/2001  priya   rain          5

In [69]:
df1["temp"][2]

3

In [70]:
# how to print the number of columns
df.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [73]:
# how to print a particular column
df1.date

0    12/12/2023
1     10/9/2001
2      3/3/2021
3     14/8/2001
Name: date, dtype: object

In [74]:
df1["date"]

0    12/12/2023
1     10/9/2001
2      3/3/2021
3     14/8/2001
Name: date, dtype: object

In [77]:
# type of data frame is pandas core series series
type(df1["temp"])

pandas.core.series.Series

In [80]:
# how to print two or more columns side by side
df1[["temp","date"]]

   temp        date
0     1  12/12/2023
1     2   10/9/2001
2     3    3/3/2021
3     4   14/8/2001

In [82]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [87]:
# suppose from your dataset you want to find the highest temperature
df.Temperature.max() #or# df["Temperature"].max()

50

In [89]:
# how to find the statistics of your data frame
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,31.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.225806,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,3.422569,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,0.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.000000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [93]:
# give me rows which have temperature more than or equal to 32?
df[df["Temperature"]>=32]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,0.0,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,0.0,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [96]:
#Get the row where tmperature is maximum
df[df["Temperature"]==df["Temperature"].max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,0.0,1.8,7,Rain,109

In [98]:
#get only event column for maximum temperature
df["Events"][df["Temperature"]==df["Temperature"].max()]

9    Rain
Name: Events, dtype: object

In [101]:
#get more than one column for maximum temperature
df[["EST","Events"]][df["Temperature"]==df["Temperature"].max()]

         EST Events
9  1/10/2016   Rain

In [102]:
df.index

RangeIndex(start=0, stop=31, step=1)

In [103]:
df1

   temp        date   name  event  windspeed
0     1  12/12/2023   raja   rain          2
1     2   10/9/2001  lolit    sun          3
2     3    3/3/2021   mili  cloud          4
3     4   14/8/2001  priya   rain          5

In [104]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [105]:
# how to set/change the index
df1.set_index("temp")

            date   name  event  windspeed
temp
1     12/12/2023   raja   rain          2
2      10/9/2001  lolit    sun          3
3       3/3/2021   mili  cloud          4
4      14/8/2001  priya   rain          5

In [106]:
# but if you run df1 it will show the same as prev, will not get updated
df1

   temp        date   name  event  windspeed
0     1  12/12/2023   raja   rain          2
1     2   10/9/2001  lolit    sun          3
2     3    3/3/2021   mili  cloud          4
3     4   14/8/2001  priya   rain          5

In [135]:
#so for this we have to (inplace=True)
df1.set_index("temp",inplace=True)

In [132]:
df1

            date   name  event  windspeed
temp
1     12/12/2023   raja   rain          2
2      10/9/2001  lolit    sun          3
3       3/3/2021   mili  cloud          4
4      14/8/2001  priya   rain          5

In [121]:
#gives output the given label
df1.loc[2]

date         10/9/2001
name             lolit
event              sun
windspeed            3
Name: 2, dtype: object

In [122]:
df1.loc[1:3]

            date   name  event  windspeed
temp
1     12/12/2023   raja   rain          2
2      10/9/2001  lolit    sun          3
3       3/3/2021   mili  cloud          4

In [120]:
#gives the output of the given position
df1.iloc[2]

date         3/3/2021
name             mili
event           cloud
windspeed           4
Name: 3, dtype: object

In [124]:
df1.iloc[1:3]

           date   name  event  windspeed
temp
2     10/9/2001  lolit    sun          3
3      3/3/2021   mili  cloud          4

In [136]:
# how to reset the index
# but it will not get updated until we use inplace=True
#df1.reset_index("temp")
# if you run this more than onwe times it will not work beause it will get reset to the original one at first when you rum reset
df1.reset_index("temp",inplace=True)

In [137]:
df1

   temp        date   name  event  windspeed
0     1  12/12/2023   raja   rain          2
1     2   10/9/2001  lolit    sun          3
2     3    3/3/2021   mili  cloud          4
3     4   14/8/2001  priya   rain          5

In [140]:
df1.loc[1:3]

   temp       date   name  event  windspeed
1     2  10/9/2001  lolit    sun          3
2     3   3/3/2021   mili  cloud          4
3     4  14/8/2001  priya   rain          5

In [141]:
df1.iloc[1:3]

   temp       date   name  event  windspeed
1     2  10/9/2001  lolit    sun          3
2     3   3/3/2021   mili  cloud          4